# Lesson 3: numpy and pandas

## Numpy

In [2]:
import numpy as np

a = np.array([12,23,34,33,55,66])
b = np.arange(6)
c = np.zeros(6)
d = np.ones(6, dtype = np.int)
e = np.random.random(6)
f = b-a

print (a, b, c, d, e, f, sep = '\n')

[12 23 34 33 55 66]
[0 1 2 3 4 5]
[ 0.  0.  0.  0.  0.  0.]
[1 1 1 1 1 1]
[ 0.72916555  0.09868854  0.43565831  0.92063333  0.65823753  0.69572092]
[-12 -22 -32 -30 -51 -61]

In [4]:
print (f > -22)

[ True False False False False False]

In [13]:
a = np.array([[1,2,3], [3,4,5]])
b = np.arange(6).reshape(2,3)
c = np.zeros((2,3))
d = np.ones((2,3))

In [17]:
s = a.sum()
print (s)

18

In [18]:
s2 = a.sum(axis=1)
print (s2)
s3 = a.sum(axis=0)
print (s3)

[ 6 12]
[4 6 8]

dot
vstack
hstack
vsplit
hsplit

## Exercise
* use numpy to declare the grade of a student 
* declare a matrix to store the weight of each course,
* calculate the final grade of the student

In [6]:
grade = np.array([[12,23,34], 
                 [45,56,0]])
weight = np.array([0.2, 0.3, 0.5])

print ("Two stuents grade in Eng, Math, Phy are", grade[0], "and", grade[1])
print ("The weight of Eng, MAth, Phy is", weight)
sum = grade.dot(weight)
print ("Their final grade is: ", sum)

Two stuents grade in Eng, Math, Phy are [12 23 34] and [45 56  0]
The weight of Eng, MAth, Phy is [ 0.2  0.3  0.5]
Their final grade is:  [ 26.3  25.8]

# Pandas
* based on numpy
* support tag (field)

In [2]:
# 類似 list, 但是是基於 np 建置的，且可以放不同的型態
import pandas as pd
import numpy as np
s1 = pd.Series(['john', 180, 72, True])
s2 = pd.Series(['mary', 160, 60, True])
s3 = pd.Series(['nick', 170, 78, False])
print (s1, s2, s3)

0    john
1     180
2      72
3    True
dtype: object 0    mary
1     160
2      60
3    True
dtype: object 0     nick
1      170
2       78
3    False
dtype: object

In [5]:
d = np.random.randn(2,3)# randn: normal distribution
print (type(d))
df = pd.DataFrame(d) # build the df based on a ndarray object

<class 'numpy.ndarray'>

In [6]:
print (df)

          0         1         2
0 -0.721926 -0.104707  0.038830
1 -0.080304  1.095248 -0.574109

In [25]:
df

          0         1         2
0  1.572836 -0.418117 -0.529881
1  1.094617 -0.927541 -0.242348

In [12]:
g = np.random.randint(100, size=(5,3))
grade = pd.DataFrame(g) # the grade of five student
print (grade) # no index

studentID = ['s01', 's02','s03','s04','s05']
subjects = ['eng', 'math', 'phy']
grade = pd.DataFrame(g, index = studentID, columns=subjects)
print (grade)

    0   1   2
0  20  79   4
1   5  26  81
2  48  53  49
3  38  95  83
4  68  25  27
     eng  math  phy
s01   20    79    4
s02    5    26   81
s03   48    53   49
s04   38    95   83
s05   68    25   27

## column selection

In [102]:
grade['eng'] # based on field

s01    20
s02     5
s03    48
s04    38
s05    68
Name: eng, dtype: int64

In [103]:
grade[['eng','math']]

     eng  math
s01   20    79
s02    5    26
s03   48    53
s04   38    95
s05   68    25

## row selection
* loc: based on index
* iloc: based on location

In [18]:
print (grade[0:3]) # based on location
print (grade.iloc[0:3]) # based on location

     eng  math  phy
s01   20    79    4
s02    5    26   81
s03   48    53   49
     eng  math  phy
s01   20    79    4
s02    5    26   81
s03   48    53   49

In [32]:
# based on index (label)
print (grade.loc['s01']) 
print (grade.loc['s01', :])
# print (grade.loc['s01', 0:2]) ERROR

eng     20
math    79
phy      4
Name: s01, dtype: int64
eng     20
math    79
phy      4
Name: s01, dtype: int64

In [23]:
d = grade.iloc[0:3]['eng'] # based on location and field
print (d)

s01    20
s02     5
s03    48
Name: eng, dtype: int64

In [26]:
d = grade.loc['s01']['eng'] # based on location and field
print (d)

20

## row filtering

In [105]:
grade[grade.math<60]

     eng  math  phy
s02    5    26   81
s03   48    53   49
s05   68    25   27

In [108]:
grade[(grade.math>60) & (grade.eng>60) & (grade.phy>60)]

Empty DataFrame
Columns: [eng, math, phy]
Index: []

## sorting
* sort_values(by=XXX, ascending=True/False)

In [109]:
g2 = grade.copy()
g2.sort_values(by='eng')

     eng  math  phy
s02    5    26   81
s01   20    79    4
s04   38    95   83
s03   48    53   49
s05   68    25   27

In [110]:
g2.sort_values(by='eng', ascending=False)

     eng  math  phy
s05   68    25   27
s03   48    53   49
s04   38    95   83
s01   20    79    4
s02    5    26   81

## join

In [97]:
g1 = np.array([[100,2,3],[4,5,6],[5,5,5]])
g2 = np.array([[100,100,100], [100,100,100],[100,100,100]])

s1 = ['s01', 's02','s03']
s2 = ['s01', 's04','s05']
j1 = ['eng', 'math', 'phy']
j2 = ['eng', 'java', 'python']
grade1 = pd.DataFrame(g1, index = s1, columns=j1)
grade2 = pd.DataFrame(g2, index = s2, columns=j2)

In [98]:
pd.concat((grade1, grade2))

     eng   java  math  phy  python
s01  100    NaN   2.0  3.0     NaN
s02    4    NaN   5.0  6.0     NaN
s03    5    NaN   5.0  5.0     NaN
s01  100  100.0   NaN  NaN   100.0
s04  100  100.0   NaN  NaN   100.0
s05  100  100.0   NaN  NaN   100.0

In [36]:
pd.concat((grade1, grade2), join='inner')

     eng
s01    1
s02    4
s03    5
s01  100
s04  100
s05  100

In [50]:
# merge: Use intersection of keys from both frames
print (pd.merge(grade1, grade2, on='eng'))

   eng  math  phy  java  python
0  100     2    3   100     100
1  100     2    3   100     100
2  100     2    3   100     100

## summary
* index
* columns
* shape
* values
* info()
* describe()

In [81]:
g3 = np.array([['nick',100,2,3],
               ['john', 40,5,6],
               ['peter', 40,5,6],
               ['mary', 40,5,6],
               ['json', 40,5,6],
               ['alex', 50,5,5]])

j1 = ['name', 'eng', 'math', 'phy']
grade3 = pd.DataFrame(g3, columns=j1)

         name eng math phy
count       6   6    6   6
unique      6   3    2   3
top     peter  40    5   6
freq        1   4    5   4

In [82]:
grade3.index

RangeIndex(start=0, stop=6, step=1)

In [78]:
grade3.columns

Index(['name', 'eng', 'math', 'phy'], dtype='object')

In [83]:
grade3.dtypes

name    object
eng     object
math    object
phy     object
dtype: object

In [84]:
grade3.shape

(6, 4)

In [85]:
grade3.values

array([['nick', '100', '2', '3'],
       ['john', '40', '5', '6'],
       ['peter', '40', '5', '6'],
       ['mary', '40', '5', '6'],
       ['json', '40', '5', '6'],
       ['alex', '50', '5', '5']], dtype=object)

In [91]:
grade3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
name    6 non-null object
eng     6 non-null object
math    6 non-null object
phy     6 non-null object
dtypes: object(4)
memory usage: 272.0+ bytes

In [90]:
grade3.describe()

         name eng math phy
count       6   6    6   6
unique      6   3    2   3
top     peter  40    5   6
freq        1   4    5   4

#### Their types are Object, so the numeric summary is not shown
* when their data type is int, it will summarize their std, min, ...

In [99]:
df = pd.DataFrame(np.random.randint(100, size=(100,4)))
print (df.info())
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
0    100 non-null int64
1    100 non-null int64
2    100 non-null int64
3    100 non-null int64
dtypes: int64(4)
memory usage: 3.2 KB
None

                0           1           2           3
count  100.000000  100.000000  100.000000  100.000000
mean    46.520000   48.570000   48.600000   50.140000
std     27.342748   27.619074   30.711101   28.701536
min      0.000000    1.000000    1.000000    0.000000
25%     23.500000   24.000000   20.750000   27.250000
50%     49.000000   49.500000   44.500000   50.500000
75%     66.000000   71.000000   78.000000   73.250000
max     97.000000   99.000000   99.000000   98.000000

In [89]:
grade4 = pd.DataFrame(dict(name = ['nick','john','mary'],
                         eng=[100,90,20],
                         math=[90,56,76],
                         phy=[87,45,32]))
grade4.describe()

              eng       math        phy
count    3.000000   3.000000   3.000000
mean    70.000000  74.000000  54.666667
std     43.588989  17.088007  28.746014
min     20.000000  56.000000  32.000000
25%     55.000000  66.000000  38.500000
50%     90.000000  76.000000  45.000000
75%     95.000000  83.000000  66.000000
max    100.000000  90.000000  87.000000

In [95]:
grade4.info() # only name's type is object, others are int64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
eng     3 non-null int64
math    3 non-null int64
name    3 non-null object
phy     3 non-null int64
dtypes: int64(3), object(1)
memory usage: 176.0+ bytes

### selection

In [27]:
d = grade['eng'>50]

TypeError: '>' not supported between instances of 'str' and 'int'

In [41]:
eat2.iloc[1:3]

    0   1   2
1  60  50  55
2  75  95  95